{
  "memories": [
    [
      2003,
      "I remember gazing up at lighted red chili peppers and talking to a beautiful girl on the phone while the smell of incense wafted around my too-large room on Shoal Creek.",
      "glass-window.jpg"
    ],
    [2004, "I remember", ".jpg"],
    [
      2005,
      "I remember the feel of the Pacific air on my skin, drifting through open windows and over us in our little bungalo-suite in Kauai.",
      "kauai-poipu.jpg"
    ],
    [
      2005,
      "I remember cool evenings at dusk walking down 43rd holding your hand, trading casual comments about architecture and decor on our way to the little restaurant where they know us by name.",
      "julios.jpg"
    ],
    [
      2006,
      "I remember songs we sang on a stage in a small church with an overhead projector and an Arts Pastor.",
      "dwotaylor.jpg"
    ],
    [
      2006,
      "I remember one night in Bangkok, the salty breeze off the Bosphorus, an “overnight train”, enormous pizza with Ania Blaszczynska, and contentious Irish bread choices.",
      "turkey.jpg"
    ],
    [
      2007,
      "I remember being in the hospital, exhausted and elated, I tried to hold Molly so you could rest but I kept falling asleep in my chair.",
      "molly.jpg"
    ],
    [
      2007,
      "I remember drives through the hills or the pines, going to visit one or the other family in their Texas town.",
      "elliott-graduation.jpg"
    ],
    [2009, "I remember", ".jpg"],
    [
      2010,
      "I remember dropping off a large and significant envelope of paperwork and buying you an amber ring in Minneapolis.",
      "luisa-first-pic-on-white.jpg"
    ],
    [
      2010,
      "I remember the love I hold for you readily, and feel the weight and glory of how it has grown over these years.",
      "fox-wedding.jpg"
    ],
    [
      2012,
      "I remember weeks of parks, Crepes & Waffles ice cream, rice baths, and juevos revueltos con jamon.",
      "en-colombia.jpg"
    ],
    [
      2012,
      "I remember a dinner with other new-comers, finding a story-rich culture and would-be lifelong friendships.",
      "morrises.png"
    ],
    [
      2012,
      "I remember the weight of uncertainty that came with the first significant diagnosis for our new hija.",
      "luisa-2.jpg"
    ],
    [
      2012,
      "I remember sorrows we’ve held that feel like the last threads are giving way, but they have not, and the Lord remains our thread-mender and our strength.",
      "kauai-couple.jpg"
    ],
    [
      2013,
      "I remember long nights in a small room, surrounded by paper and antiquated machinery, away from my family.",
      "mirth-11.jpg"
    ],
    [
      2013,
      "I remember the incredulity and hope in the discovery of ECI, whose presence served Lu’s physical needs and our emotional needs.",
      "luisa-walker.jpg"
    ],
    [
      2013,
      "I remember squishing tiny legs into tiny plastic orthotics while singing and barking about a doggy in a window.",
      "tiny-legs.jpg"
    ],
    [
      2013,
      "I remember Advent Gatherings with big pots of chili, readings, and songs surrounded by candlelight and hope.",
      "bed.jpg"
    ],
    [
      2014,
      "I remember dear, kindred times in the Frio River Valley eating ice cream and cobbler while the guitar was passed around.",
      "laity-fire-and-music.jpg"
    ],
    [
      2014,
      "I remember a young, restless reader with a book receipt many times the length of her petite body.",
      "library-receipt.jpg"
    ],
    [
      2014,
      "I remember an evening of talents shared near a familiar beach, involving a trio of Irish sisters, vague balletic movement, and a man in a black wig.",
      "rehoboth.jpg"
    ],
    [
      2014,
      "I remember an old master passing craft down to a young buck, resulting in a half-finished half-duck.",
      "duck.jpg"
    ],
    [
      2014,
      "I remember the affection I feel in my skin and in my soul when I hold your hand in mine, and how it’s changed over these years from butterflies in my belly to deep, familiar comfort and care.",
      "us-galveston.jpg"
    ],
    [
      2015,
      "I remember a weighty grief as the brokenness of our world began revealing itself to a joyful, generous, and courageous child who possessed greater depths than we’d realized.",
      "molly-halloween.jpg"
    ],
    [
      2015,
      "I remember weekly exhortations, month after month, determined to bias our resolve to partake of the Deli or the Shack.",
      "tacodeli.jpg"
    ],
    [
      2016,
      "I remember a father losing and finding his father, and the long-held sorrow that remained.",
      "randy-and-shaun.jpg"
    ],
    [
      2016,
      "I remember a terror in a wheelchair in a place with large rodents and kind service after a dreadful surgery that would change her life.",
      "lu-surgery.jpg"
    ],
    [
      2016,
      "I remember finding new hope in a house in the woods filled with weird people, where a daughter learned to cherish the world around her and was known for killing flowers and bringing joy.",
      "acton.jpg"
    ],
    [
      2016,
      "I remember bringing home a small, lamb-like pup that brought with him great joy, frustration, and finally love.",
      "andy2.jpg"
    ],
    [
      2016,
      "I remember the burden and glory of parenting our two dear ones, through waves in high tides and low, pulled by the moon with its visible-then-not rhythms.",
      "cowgirls.jpg"
    ],
    [
      2017,
      "I remember a zombie, a surgery, and a lengthy time where our girl was unable to sleep in her bed.",
      "lu-texfed.jpg"
    ],
    [
      2017,
      "I remember a trip to a big city with the woman I love, delectable gluten-free pizza, and a small theatre bearing witness to a musical hip hop phenomenon.",
      "nyc-hamilton.jpg"
    ],
    [
      2017,
      "I remember a birthday gathering to celebrate my love’s four decades of life, surrounded by dear friends with special gifts and yummy food.",
      "kt-40.jpg"
    ],
    [
      2018,
      "I remember a concert in our large backyard and a play in our too-small living room at our first house and third home.",
      "paul-and-trisha.jpg"
    ],
    [
      2018,
      "I remember the joys that surprise us, creeping up in the midst of our full days, interrupting our distraction, and reminding us of our frail and purposeful humanness and that each new morning brings mercy anew.",
      "bed.jpg"
    ],
    [
      2020,
      "I remember – perhaps too well – a virus that shut down the globe and drove us to isolation for safety.",
      "covid.jpg"
    ],
    [
      2020,
      "I remember when a long-winded project came to fruition and we were able to get our mattress off of the floor.",
      "bed-finished.jpg"
    ],
    [
      2022,
      "I remember finding a place near a park that would become our second house and fourth home.",
      "overton.jpg"
    ],
    [
      2022,
      "I remember slow-paced Saturday mornings with artists and their work, yummy food, and sharing in each others’ joys and sorrows.",
      "artists.jpg"
    ],
    [
      2023,
      "I remember a decade-long dream fulfilled in a historic house that we packed to the gills with artists.",
      "artists-retreat.jpg"
    ],
    [
      2023,
      "I remember how we began this life together, navigating unforeseeable rivers and eddies over these years.",
      "us-early-on.jpg"
    ]
  ]
}
